tap "xe/pkgs"

# programming languages
brew "go@1.22"
brew "node@20"
brew "deno"
brew "python@3.11"
brew "rustup-init"

# build tools / libraries
brew "cmake"
brew "libtool"
brew "pkg-config"
brew "libavif"
brew "libheif"
brew "x265"
brew "x264"
brew "libde265"
brew "libjpeg"
brew "aom"
brew "sqlite"

# dhall
brew "dhall"
brew "dhall-lsp-server"
brew "dhall-json"

# devops
brew "hey"
brew "opentofu"
brew "flyctl"
brew "earthly"
brew "pandoc"
brew "jq"
brew "jo"

# frontend tools
brew "esbuild"
brew "tailwindcss"
brew "xe/pkgs/templ"

# kubernetes
brew "kubectl"
brew "k9s"

# protocol buffers
brew "buf"
brew "grpcurl"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "xe/pkgs/protoc-gen-twirp"
brew "xe/pkgs/protoc-gen-connect-go"
brew "xe/pkgs/protoc-gen-connect-openapi"